Repository: pallets/click
Catalog: locales/*/LC_MESSAGES/click.po
Languages: bg_bg

source: {editor}: Editing failed
bg_bg: {editor}: Редактирането се провалили

source: {editor}: Editing failed: {e}
bg_bg: {editor}: Редактирането се провалили: {e}

source: Aborted!
bg_bg: Авария!

source: Show this message and exit.
bg_bg: Покажи това съобщение и излез.

source: Usage:
bg_bg: Използване:

source: (Deprecated) {text}
bg_bg: (Депрекиран) {text}

source: Options
bg_bg: Опции

source: Got unexpected extra argument ({args})
bg_bg: Получен е неочакван допълнителен аргумент ({args})

source: DeprecationWarning: The command {name!r} is deprecated.
bg_bg: DeprecationWarning: Командата {name!r} е депрекирана.

source: Commands
bg_bg: Команди

source: Missing command.
bg_bg: Липсва команда.

source: No such command {name!r}.
bg_bg: Няма команда {name!r}.

source: Argument {name!r} takes {nargs} values but 1 was given.
bg_bg: Аргументът {name!r} приема {nargs} стойности, но е дадена 1.

source: env var: {var}
bg_bg: променлива на средата: {var}

source: default: {default}
bg_bg: по подразбиране: {default}

source: required
bg_bg: задължително

source: %(prog)s, version %(version)s
bg_bg: %(prog)s, версия %(version)s

source: Show the version and exit.
bg_bg: Покажи версията и излез.

source: Error: {message}
bg_bg: Грешка: {message}

source: Try '{command} {option}' for help.
bg_bg: Опитайте '{command} {option}' за помощ.

source: Invalid value: {message}
bg_bg: Невалидна стойност.

source: Invalid value for {param_hint}: {message}
bg_bg: Невалидна стойност за {param_hint}: {message}

source: Missing argument.
bg_bg: Липсващ аргумент.

source: Missing option.
bg_bg: Липсваща опция.

source: Missing parameter.
bg_bg: Липсващ параметър.

source: Missing {param_type}.
bg_bg: Липсва {param_type}.

source: Missing parameter: {param_name}
bg_bg: Липсващ параметър: {param_name}

source: No such option: {name}
bg_bg: Няма такава опция: {name}.

source: Did you mean {possibility}?
bg_bg: Имали сте предвид {possibility}?

source: unknown error
bg_bg: неизвестна грешка

source: Could not open file {filename!r}: {message}
bg_bg: Не можах да отворя файла {filename!r}: {message}

source: Argument {name!r} takes {nargs} values.
bg_bg: Аргументът {name!r} приема {nargs} стойности.

source: Option {name!r} does not take a value.
bg_bg: Опцията {name!r} не приема стойности.

source: Option {name!r} requires an argument.
bg_bg: Опцията {name!r} изисква аргумент.

source: Repeat for confirmation
bg_bg: Повторете за потвърждение

source: Error: The value you entered was invalid.
bg_bg: Грешка: Въведената стойност е невалидна.

source: Error: The two entered values do not match.
bg_bg: Грешка: Двете въведени стойности не съвпадат.

source: Error: invalid input.
bg_bg: Грешка: невалидна въведена стойност.

source: Press any key to continue...
bg_bg: Натиснете произволен клавиш, за да продължите...

source: Choose from: {choices}
bg_bg: Изберете сред: {choices}

source: {value!r} is not {choice}.
bg_bg: {value!r} не съвпада с {choice}.

source: {value!r} does not match the format {format}.
bg_bg: {value!r} няма формат {format}.

source: {value!r} is not a valid {number_type}.
bg_bg: {value!r} не е валидно {number_type}.

source: {value!r} is not a valid {range}.
bg_bg: {value!r} не в диапазона {range}.

source: {value!r} is not a valid boolean.
bg_bg: {value!r} не е валидна булева стойност.

source: {value!r} is not a valid UUID.
bg_bg: {value!r} не е валидно UUID.

source: file
bg_bg: файл

source: directory
bg_bg: директория

source: path
bg_bg: път

source: {name} {filename!r} does not exist.
bg_bg: {name} {filename!r} не съществува.

source: {name} {filename!r} is a file.
bg_bg: {name} {filename!r} е файл.

source: {name} {filename!r} is a directory.
bg_bg: {name} {filename!r} е директория.

source: {name} {filename!r} is not writable.
bg_bg: не е позволено записването в {name} {filename!r}.

source: {name} {filename!r} is not readable.
bg_bg: не е позволено четенето от {name} {filename!r}.
